Repository: cran/metR
Catalog: po/R-*.po
Languages: es

source: 'lon' lower than 180 is not a valid longitude
es: 'lon' menor a 180 no es una longitud válida

source: 'lon' greater than 360 is not a valid longitude
es: 'lon' mayor a 360 no es una longitud válida

source: One boundary condition per variable needed.
es: Se necesita una condición de contorno por variable.

source: Cyclical derivatives on a non-equispaced grid not yet supported.
es: Derivadas cíclicas en grillas no equiespaciadas no soportadas.

source: 'DivideTimeseries' is deprecated, use ggwrap instead (https://github.com/wilkox/ggwrap).
es: 'DivideTimeseries' está deprecada, usar ggwrap (https://github.com/wilkox/ggwrap).

source: 'DivideTimeseries' needs the gridExtra package. Install it with 'install.packages("gridExtra")'.
es: 'DivideTimeseries' necesita el paquete gridExtra. Instalarlo con 'install.packages("gridExtra")'.

source: Columns not found in data: %s.
es: Columnas no encontradas en 'data': %s.

source: The formula %s does not identify an unique observation for each cell.
es: La fórmula %s no identifica una observación única para cada celda.

source: Importance of components:
es: Importancia de las componentes:

source: Component
es: Componente

source: Explained variance
es: Varianza explicada

source: Cumulative variance
es: Varianza acumulada

source: 'object' must be an EOF object.
es: 'object' tiene que ser un objeto EOF.

source: No data available for any of selected dates.
es: No hay datos para ninguna de las fechas seleccionadas.

source: No data for available for these dates: %s.
es: No hay datos disponibles para las siguientes fechas: %s.

source: 'lat.north' can't be smaller than 'lat.south'.
es: 'lat.north' no puede ser menor que 'lat.south'.

source: 'lon.east' can't be smaller than '.lon.west'.
es: 'lon.east¡ no puede ser menor que 'lon.west'.

source: Failed to fetch file.
es: No se pudo leer el archivo.

source: Too many state variables.
es: Demasiadas variables de estado.

source: Too few state variables.
es: Muy pocas variables de estado.

source: LHS of formula must have at least one variable
es: El lado izquierdo de la fórmula debe tener al menos una variable

source: RHS of formula must be of the form x + y
es: El lado derecho de la fórmula debe ser de la forma x + y

source: Imputing missing values.
es: Imputando valores faltantes.

source: Linear imputation failed. Try passing a constant number or a function (e.g. 'na.fill = mean').
es: Imputación lineal falló. Intente pasando una constante o una función (p.e. 'na.fill = mean').

source: %s column has no missing values. Returning unchanged vector.
es: La columna %s no tiene valores faltantes. Devolviendo el vector original.

source: 'data' has no missing values. Returning unchanged matrix.
es: 'data' no tiene valores faltantes. Devolviendo la matriz original.

source: 'data' must be matrix or data frame if not NULL.
es: El argumento 'data' debe ser una matriz o un data frame si no es NULL.

source: `order` must be logical or character
es: `order` tiene que ser un caracter o un valor lógico

source: Interpolate need a unique value for each x and y
es: Interpolate necesita un valor único para cada combinación de x e y

source: Only 1 dimension in 'formula'. Ignoring 'y.out'.
es: Sólo una dimensión en 'formula'. Ignorando 'y.out'.

source: duplicate values on x.out. If x.out is a vector of locations, use grid = FALSE
es: valores duplicados en x.out. Si x.out es un vector de puntos, usar grid = FALSE

source: duplicate values on y.out. If y.out is a vector of locations, use grid = FALSE
es: valores duplicados en y.out. Si y.out es un vector de puntos, usar grid = FALSE

source: x.out is not of the same length as y.out. If x.out and y.out define unique points on a regular grid, use grid = TRUE
es: x.out no tiene la misma longitud que y.out. Si x.out e y.out definen puntos único en una grilla regular, use grid = TRUE

source: wrong mode, choose either "grid" or "locations"
es: modo incorrecto, debe ser "grid" o "locations"

source: either `xs` or `ys` must be of length greater than 1
es: `xs` o `ys`debe tener una longitud mayor a 1

source: `x` must be a numeric vector
es: `x` debe ser un vector numérico

source: `y` must be a numeric vector
es: `y` debe ser un vector numérico

source: %s not implemented yet.
es: %s no está implementado aún.

source: ReadNetCDF needs package'ncdf4'. Install it with 'install.packages("ncdf4")'
es: ReadNetCDF necesita el paquete 'ncdf4'. Instálelo con 'install.packages("ncdf4")'

source: No variables selected. Returning NULL
es: No se seleccionaron variables. Devolviendo NULL

source: Invalid variables selected. Bad variables: %s.
es: Variables seleccionadas son inválidas. Variables con problemas: %s.

source: Subsetting dimensions not found: %s.
es: Dimensiones para filtrar no encontradas: %s.

source: Multiple subsets only supported for `out = "data.frame"
es: Múltiples filtros sólo soportados para `out = "data.frame"`

source: Time parsing failed. Returing raw values in %s. Install udunits2 with 'install_packages("udunits2")' to parse it automatically.
es: Falló el parseo del tiempo. Devolviendo valores crudos en %s. Instale udunits2 con 'install_packages("udunits2")' para parsear automáticamente.

source: ----- Dimensions -----
es: ----- Dimensiones -----

source: Dimensions:
es: Dimensiones:

source: by
es: por

source: (Scaled)
es: (Escalado)

source: %s: %d values from %s to %s %s
es: %s: %d valores de %s a %s %s

source: 'WrapCircular' is deprecated, use ggperiodic::wrap instead.
es: 'WrapCircular' está deprecada, use ggperiodic::wrap.

source: LHS of formula must have at least one variable.
es: El lado izquierdo de la fórmula debe tener al menos una variable.

source: LHS of formula must be of the form dx + dy.
es: El lado izquierdo de la fórmula debe ser de la forma dx + dy.

source: RHS of formula must be of the form x + y + t.
es: El lado derecho de la fórmula debe ser de la forma x+ y + t.

source: 'pivot' must be a number between 0 and 1.
es: 'pivot' debe ser un número entre 0 y 1.

source: 'pivot' greater than 1, setting it to 1.
es: 'pivot' mayor a 1, reemplazándolo por 1.

source: 'pivot' less than 0, setting it to 0.
es: 'pivot' menor a 0, reemplazándolo por 0.

source: 'direction' must be either "ccw" or "cw"
es: 'direction' debe ser "ccw" o "cw".

source: stat_arrow needs wither 'mag' and 'angle' or 'dx' and 'dy'.
es: stat_arrow necesita 'mag' y 'angle', o 'dx' y 'dy'.

source: The use of preserve.dir = FALSE with discrete scales is not recommended.
es: Usar 'preserve.dir = FALSE' con escalas discretas no es recomendable.

source: The use of preserve.dir = FALSE with date scales is not recommended.
es: Usar 'preserve.dir = FALSE' con escalas de fecha no es recomendable.

source: 'xwrap' and 'ywrap' will be deprecated. Use ggperiodic::periodic insead.
es: 'xwrap' y 'ywrap' serán deprecadas. Use ggperiodic::periodic.

source: %s: If you are using dotted or dashed lines, colour, size and linetype must be constant over the line.
es: %s: Si está usando lineas punteadas o con líneas, entonces 'colour', 'size' y 'linetype' tiene que ser constante para cada línea.

source: Specify either 'position' or 'nudge_x'/'nudge_y'
es: Especificar 'posición' o 'nudge_x' o 'nudge_y'.

source: Non lineal coordinates are not implemented in GeomRelief.
es: Coordenadas no lineales no implementadas en GeomRelief.

source: geom_raster only works with Cartesian coordinates.
es: geom_raster sólo funciona con coordenadas cartesianas.

source: Non lineal coordinates are not implemented in GeomShadow.
es: Coordenadas no lineales no implementadas en GeomShadow.

source: Performing only 1 integration step, please consider increasing the resolution.
es: Realizando sólo 1 paso de integración, considere aumentar la resolución.

source: 'x' and 'y' do not define a regular grid.
es: x e y no definen una grilla regular.

source: Specify either 'position' or 'nudge_x'/'nudge_y'.
es: Especificar 'posición' o 'nudge_x' o 'nudge_y'.

source: colorstrip guide needs colour or fill scales.
es: la guía 'colorstrip' necesita escalas 'colour' o 'fill'.

source: colorstrip guide needs continuous scales.
es: la guía 'colorstrip' necesita escalas continuas.

source: Invalid breaks specification. Use NULL, not NA
es: Especificación de 'breaks' inválida. Use NULL, no NA

source: Label position "%s" is invalid.
es: La posición de la etiqueta "%s" no es válida.

source: Unknown input.
es: Entrada desconocida.

source: Duplicated aesthetics after name standardisation: %s
es: Estéticas duplicadas luego de estandarización de nombres: %s

source: %s needs packages %s. Install them with: 'install.packages(c("%s"))'.
es: La función %s necesita los paquetes %s. Instálelos con: 'install.packages(c("%s"))'.

source: Breaks not formatted correctly for a bin legend. Use '(<lower>, <upper>]' format to indicate bins.
es: Los valores de corte no tienen el formato correcto para una leyenda discretizada. Use '(<mínimo>, <máximo>]' para indicar cada corte.

source: Discretised scales only support discrete data.
es: Escalas discretizadas no suportan datos discretos.

source: User supplied limits don't correspond to valid breaks. %s rounded to %s
es: Límites dados por el usuario no corresponden a cortes válidos. Se redondeó %s a %s

source: Breaks not formatted correctly for a bin legend. Use `(<lower>, <upper>]` format to indicate bins.
es: Los valores de corte no tienen el formato correcto para una leyenda discretizada. Use `(<minimo>, <máximo>]` para indicar cada corte.

source: 'breaks' and 'labels' must have the same length.
es: 'breaks' y 'labels' deben ser de la misma longitud.

source: All variables must have the same length
es: Todas las variables tienen que tener la misma longitud

source: Computation failed in `%s()`: %s
es: Computación falló en `%s()`: %s

source: The data must be a complete regular grid.
es: 'data' debe ser una grilla regular completa.

source: kriging failed. Perhaps the number of points is too small.
es: kriging falló. Quizás el número de puntos es demasiado pequeño.

source: Not possible to generate contour data.
es: No es posible generar líneas de contorno.

source: Projection requires the proj4 package. Install it with 'install.packages("proj4")'.
es: Proyectar requiere el paquete 'proj4'. Instálelo con 'install.packages("proj4")'.

source: Contour requires single 'z' at each combination of 'x' and 'y'.
es: Para calcular contornos se requiere un único valor de 'z' en cada combinación de 'x' e 'y'.

source: Computation failed in `%s()`: %s.
es: Computación falló en '%s()': %s.

source: label must be of length 1
es: 'label' tiene que ser de longitud 1

source: With %d eof - rmse = %.3f
es: Con %d eof - rmse = %.3f
